{
    "peft_type": "LORA",
    "auto_mapping": null,
    "base_model_name_or_path": "./tmp/models/Phi3-Ex-Untrained",
    "revision": null,
    "task_type": "CAUSAL_LM",
    "inference_mode": false,
    "r": 16,
    "target_modules": "all-linear",
    "lora_alpha": 16,
    "lora_dropout": 0.05,
    "fan_in_fan_out": false,
    "bias": "none",
    "use_rslora": false,
    "modules_to_save": [
      "lm_head"
    ],
    "init_lora_weights": true,
    "layers_to_transform": null,
    "layers_pattern": null,
    "rank_pattern": {},
    "alpha_pattern": {},
    "megatron_config": null,
    "megatron_core": "megatron.core",
    "loftq_config": {},
    "use_dora": false,
    "layer_replication": null
  }